#ifndef _ZLG7290_H_
#define _ZLG7290_H_

/******************************************************************************
*                                   通用配置
******************************************************************************/
/* 地址与命令定义 */
#define  SLVADDR_7290          0x70      /* Zlg7290从机地址  0x70    */
#define  SUB_KEY_7290          0x01      /* 键码值寄存器子地址   */
#define  SUB_DP_RAM_7290       0x10      /* 7290显示缓存的首地址 */
#define  SUB_FLASH_ONOFF_7290  0x0C      /* 闪烁寄存器子地址     */
#define  SUB_CMDBUF_7290       0x07      /* 命令寄存器地址       */

/**********************************函数声明**********************************/
extern void Init_7290(void);
extern int8u_t Readkey_7290(void);






#endif